////?Створення масиву
//const arr1 =[1, 2, 3, 4, 7, 8, 0, 5]
//console.log(arr1.length)
//arr1[arr1.length]=6
//console.log(arr1)
//arr1[6]=9
////?Задавання значень масиву
////?Визначення елемента масиву по індексу
//arr2=[1,2,3,4,[5,6,7,[9, 0]]]
//console.log(arr2[4][1]) //6
//console.log(arr2[4][3][0]) //9
//console.log(arr2[1]) //2
//console.log(arr2[4][2]) //7
//console.log(arr2[4][3][1]) //0
////?Зміна значень елементу в масиві
////?Додавання в кінець елементу


////?Обєднання декількох масивів


////?forEach(): Виконує задану функцію один раз для кожного елемента масиву.
//let v=arr1.forEach(element=>element)
//console.log(v)

////?map(): Створює новий масив, який містить результат виклику заданої функції для кожного елемента масиву.
////*Оновлює дані масиву
//v=arr1.map(element=>element)
//console.log(v)


////?filter(): Створює новий масив, який містить елементи, для яких задана функція повертає true.
//v=v.filter(item=>item%2==0)
//console.log(v)


////?find(): Повертає перший елемент масиву, для якого задана функція повертає true.
//v.find((element,index)=>element==8 && console.log(element, index))

////?reduce(): Застосовує задану функцію до кожного елемента масиву, редагуючи її до одного значення.
////* Тяжке для розуміння, перша змінна використовується для підрахунку, друга це елемент масиву
//let s=v.reduce((element, res)=>res+element)
//console.log(s)

////?sort(), але можна також реалізувати інші алгоритми сортування вручну. 
////?Метод sort() сортує елементи масиву і змінює сам масив.


//Напишіть функцію, яка виводить на консоль кожен елемент масиву.
const arr1 =[-5, 1.5 , 2, 3, 4, 7, 8, 0, 5]
arr1.forEach(element=>console.log(element))
//Реалізуйте функцію, яка множить кожен елемент масиву на певне число та повертає новий масив.
let v=arr1.map(element=>element*2)
console.log(v)
//Створіть функцію, яка фільтрує масив, залишаючи тільки парні числа.
let m=arr1.filter(item=>item%2==0) 
console.log(m)
//Напишіть функцію, яка знаходить перший додатний елемент у масиві.
arr1.sort((a,b)=>a-b)
console.log(arr1)
let n=arr1.filter(item=>item>0)
console.log(n[0])
//Створіть функцію, яка знаходить суму всіх елементів у масиві.
let s=arr1.reduce((element, res)=>res+element)
console.log(s)

